<a href="https://colab.research.google.com/github/PolyGon-13/DataScience_Study/blob/main/pandas/09_string.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [2]:
fruit_names=pd.Series(["Apple","Banana","Cherry"])
fruit_names

0     Apple
1    Banana
2    Cherry
dtype: object

In [3]:
pd.Series(["Apple","Banana","Cherry"],dtype="string")

0     Apple
1    Banana
2    Cherry
dtype: string

In [4]:
pd.Series(["Apple","Banana","Cherry"],dtype=pd.StringDtype())

0     Apple
1    Banana
2    Cherry
dtype: string

In [5]:
fruit_names.astype('string')

0     Apple
1    Banana
2    Cherry
dtype: string

In [17]:
ser=pd.Series(["Apple_사과","Banana_바나나","Cherry_체리",np.nan],
              index=["First "," Second","Third"," Fourth"])
print(ser)
print('\n')

ser2=pd.Series(["Apple_사과","Banana_바나나","Cherry_체리",np.nan],
              index=["First "," Second"," Third","Fourth"],dtype="string")
print(ser2)

First        Apple_사과
 Second    Banana_바나나
Third       Cherry_체리
 Fourth           NaN
dtype: object


First        Apple_사과
 Second    Banana_바나나
 Third      Cherry_체리
Fourth           <NA>
dtype: string

In [18]:
print(ser.str.lower())
print('\n')

print(ser.str.upper())
print('\n')

print(ser.str.len())

First        apple_사과
 Second    banana_바나나
Third       cherry_체리
 Fourth           NaN
dtype: object


First        APPLE_사과
 Second    BANANA_바나나
Third       CHERRY_체리
 Fourth           NaN
dtype: object


First       8.0
 Second    10.0
Third       9.0
 Fourth     NaN
dtype: float64

In [19]:
print(ser.str.split("_")) # _를 기준으로 문자열을 분할하여 리스트로 반환
print('\n')

print(ser.str.split("_",expand=True)) # expand=True는 문자열을 분할하고 각 부분을 데이터프레임의 별도 열로 표시
print('\n')

print(ser.str.split("_").str.get(1)) # 문자열을 분할하고 리스트의 2번째(인덱스 1) 요소를 선택

First        [Apple, 사과]
 Second    [Banana, 바나나]
Third       [Cherry, 체리]
 Fourth              NaN
dtype: object


              0    1
First     Apple   사과
 Second  Banana  바나나
Third    Cherry   체리
 Fourth     NaN  NaN


First       사과
 Second    바나나
Third       체리
 Fourth    NaN
dtype: object

In [22]:
idx=ser.index
print(idx)

print(idx.str.strip())
print(idx.str.lstrip())
print(idx.str.rstrip())

Index(['First ', ' Second', 'Third', ' Fourth'], dtype='object')
Index(['First', 'Second', 'Third', 'Fourth'], dtype='object')
Index(['First ', 'Second', 'Third', 'Fourth'], dtype='object')
Index(['First', ' Second', 'Third', ' Fourth'], dtype='object')

In [23]:
print(ser.str.replace("_",":",regex=False))
print('\n')

print(ser.str.replace("[^a-zA-Z\s]","",regex=True))

First        Apple:사과
 Second    Banana:바나나
Third       Cherry:체리
 Fourth           NaN
dtype: object


First       Apple
 Second    Banana
Third      Cherry
 Fourth       NaN
dtype: object

In [24]:
print(ser.str[0])
print('\n')

print(ser.str[0:4])

First        A
 Second      B
Third        C
 Fourth    NaN
dtype: object


First      Appl
 Second    Bana
Third      Cher
 Fourth     NaN
dtype: object

In [28]:
contains_A=ser.str.contains("A",na=False)
print(contains_A)
print('\n')

contains_pattern=ser.str.contains(r"[A|B][a-z]+")
print(contains_pattern)
print('\n')

fullmatch_pattern=ser.str.fullmatch(r"[A|B][a-z]+")
print(fullmatch_pattern)

First       True
 Second    False
Third      False
 Fourth    False
dtype: bool


First       True
 Second     True
Third      False
 Fourth      NaN
dtype: object


First      False
 Second    False
Third      False
 Fourth      NaN
dtype: object

In [30]:
ser3=pd.Series(["a1","b2","c3","d4a5","e6e7","f8"],dtype="string")

digits=ser3.str.extractall(r"(\d)").groupby(level=0).agg(''.join)
print(digits)
print('\n')

letters=ser3.str.extractall(r"([a-z])").groupby(level=0).agg(''.join)
print(letters)
print('\n')

split_columns=ser3.str.extract(r"(?P<Letter>[a-z]+)(?P<Digit>\d+)")
print(split_columns)

    0
0   1
1   2
2   3
3  45
4  67
5   8


    0
0   a
1   b
2   c
3  da
4  ee
5   f


  Letter Digit
0      a     1
1      b     2
2      c     3
3      d     4
4      e     6
5      f     8